app/views/orders/_custom_pizza.erb

  <tr>
    <% Crust.where(enabled: true).each do |crust| %>
---
SELECT "crusts".* FROM "crusts" WHERE "crusts"."enabled" = ?  [["enabled", "t"]]

  <tr>
    <% Topping.where(enabled: true).each do |topping| %>
---
SELECT "toppings".* FROM "toppings" WHERE "toppings"."enabled" = ?  [["enabled", "t"]]