app/views/orders/_custom_pizza.erb

  <tr>
    <% Crust.all.each do |crust| %>
---
SELECT "crusts".* FROM "crusts"

  <tr>
    <% Topping.all.each do |topping| %>
---
SELECT "toppings".* FROM "toppings"