app/views/orders/_pizza_order_fields.erb

          <h5>Toppings:
          <% sp.pizza.toppings.each do |top| %>
---
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT 1  [["id", 1]]
SELECT "toppings".* FROM "toppings" INNER JOIN "pizzas_toppings" ON "toppings"."id" = "pizzas_toppings"."topping_id" WHERE "pizzas_toppings"."pizza_id" = ?  [["pizza_id", 1]]