app/views/specials/new.erb

SELECT "crusts".* FROM "crusts" WHERE "crusts"."enabled" = ?  [["enabled", "t"]]
---
              <h4>Crust Type</h4>
              <% Crust.where(enabled: true).each do |crust| %>

SELECT "toppings".* FROM "toppings" WHERE "toppings"."enabled" = ?  [["enabled", "t"]]
---
            <tr>
              <% Topping.where(enabled: true).each do |topping| %>