app/views/carts/index.html.erb

SELECT "pizza_orders".* FROM "pizza_orders" WHERE "pizza_orders"."order_id" = ?  [["order_id", 3]]
---
  <% @orders.each do |order| %>
      <% order.pizza_orders.each do |pi_order| %>

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT 1  [["id", 1]]
SELECT "toppings".* FROM "toppings" INNER JOIN "pizzas_toppings" ON "toppings"."id" = "pizzas_toppings"."topping_id" WHERE "pizzas_toppings"."pizza_id" = ?  [["pizza_id", 1]]
---
              Toppings:
              <% pi_order.pizza.pizza.toppings.each do |topping| %>