app/controllers/carts_controller.rb

  def index
    @orders = current_user.orders.where(progress: 0)
    if @orders.length == 0
      flash[:danger] = "No current orders exist"
      redirect_to new_order_path
    end
    @grandTotal = @orders.sum :cost
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."progress" = ?  [["user_id", 2], ["progress", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."progress" = ?  [["user_id", 2], ["progress", 0]]
SELECT SUM("orders"."cost") FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."progress" = ?  [["user_id", 2], ["progress", 0]]

  def confirm
    @orders = current_user.orders.where(progress: 0)
    @orders.each do |order|
      order.progress = "completed"
      order.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."progress" = ?  [["user_id", 2], ["progress", 0]]
UPDATE "orders" SET "progress" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["progress", 1], ["updated_at", "2015-11-29 19:58:14.580813"], ["id", 12]]