app/controllers/crusts_controller.rb

  def index
    @crusts = Crust.all
---
SELECT "crusts".* FROM "crusts"

  def create
    @crust = Crust.create(crust_params)
---
INSERT INTO "crusts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Spicy Jack Cheese"], ["created_at", "2015-12-01 05:51:24.184589"], ["updated_at", "2015-12-01 05:51:24.184589"]]

  def find_crusts
    @crust = Crust.find(params[:id])
---
SELECT  "crusts".* FROM "crusts" WHERE "crusts"."id" = ? LIMIT 1  [["id", 4]]