app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."progress" = ?  [["user_id", 2], ["progress", 1]]
---
  def index
    @orders = current_user.orders.where(progress: 1)

SELECT "specials".* FROM "specials"
---
  def new
    @order = Order.new
    @specials = Special.all

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT 1  [["id", 1]]
SELECT "toppings".* FROM "toppings" INNER JOIN "pizzas_toppings" ON "toppings"."id" = "pizzas_toppings"."topping_id" WHERE "pizzas_toppings"."pizza_id" = ?  [["pizza_id", 1]]
INSERT INTO "orders" ("user_id", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["cost", 13.0], ["created_at", "2015-11-18 19:29:40.021382"], ["updated_at", "2015-11-18 19:29:40.021382"]]
INSERT INTO "pizza_orders" ("quantity", "pizza_id", "pizza_type", "order_id") VALUES (?, ?, ?, ?)  [["quantity", 1], ["pizza_id", 1], ["pizza_type", "Special"], ["order_id", 1]]
INSERT INTO "pizzas" ("crust_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["crust_id", 2], ["name", "Custom"], ["created_at", "2015-12-01 03:36:33.302727"], ["updated_at", "2015-12-01 03:36:33.302727"]]
---
  def create
    @order = Order.new(order_params)
    @order.user_id = current_user.id
    @order.pizza_orders.each do |order|
      if !order.pizza_id.nil?
        order.pizza_type = 'Special'
        @order.cost += (order.pizza.cost * order.quantity) unless order.pizza.nil?
      elsif order.has_pizza?
        order.pizza.name = 'Custom'
        @order.cost += (10.99 * order.quantity)
        order.pizza.toppings.each do |topping|
          @order.cost += (topping.cost * order.quantity)
        end
      end
    end
    if @order.save