app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 2]]
---
  def index
    @orders = current_user.orders