app/controllers/specials_controller.rb

SELECT "specials".* FROM "specials"
---
  def index
    @specials = Special.all

INSERT INTO "specials" ("cost", "pizza_path", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cost", 15.0], ["pizza_path", "supreme.jpg"], ["pizza_id", 8], ["created_at", "2015-12-02 00:53:07.190479"], ["updated_at", "2015-12-02 00:53:07.190479"]]
---
  def create
    @special = Special.create(special_params)

SELECT  "specials".* FROM "specials" WHERE "specials"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_special
    @special = Special.find(params[:id])