app/controllers/toppings_controller.rb

SELECT "toppings".* FROM "toppings"
---
  def index
    @toppings = Topping.all

INSERT INTO "toppings" ("name", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "olives"], ["cost", 0.5], ["created_at", "2015-12-01 03:55:12.434937"], ["updated_at", "2015-12-01 03:55:12.434937"]]
---
  def create
    @topping = Topping.create(topping_params)

UPDATE "toppings" SET "name" = ?, "updated_at" = ? WHERE "toppings"."id" = ?  [["name", "anchovies"], ["updated_at", "2015-12-01 04:28:28.903606"], ["id", 4]]
---
  def update
    if @topping.update(topping_params)

SELECT  "toppings".* FROM "toppings" WHERE "toppings"."id" = ? LIMIT 1  [["id", 4]]
---
  def find_topping
    @topping = Topping.find(params[:id])